import React from "react";
import { Link, Outlet } from "react-router-dom";
import info from '../../store/all.json';

class Profile extends React.Component {
    componentDidMount() {
        window.scrollTo({
            top: 0,
            left: 0,
            behavior: 'smooth'
        });
    }

    handleUploadPhotoToFeed = e => {
        const { authUser } = this.props;
        let arrayUsers = JSON.parse(localStorage.getItem('users'));
        let reader = new FileReader();
        let file = e.target.files[0];

        reader.onload = () => {
            const addPhotosToFeed = authUser.feedPhotos && Array.isArray(authUser.feedPhotos) ?
                arrayUsers.map(user => user.user_id === authUser.user_id ? { ...user, feedPhotos: authUser.feedPhotos.push(reader.result) } : { ...user })
                :
                arrayUsers.map(user => user.user_id === authUser.user_id ? { ...user, feedPhotos: [reader.result] } : { ...user })

            localStorage.setItem('users', JSON.stringify(addPhotosToFeed));
        }

        reader.readAsDataURL(file);
    }

    render() {
        const { authUser, innerWidth, urlLocation, setStateAsideFilter, themeMode } = this.props;
        const location = urlLocation.split('/').pop();

        return (
            <section className={`profile__wrapper ${themeMode}`}>
                <div className='user_title'>
                    <div>
                        <div className='profile_avatar'>
                            {/* <p>Рейтинг<span>9,5</span></p> */}
                            <img src={authUser.foto ? 'https://' + authUser.foto : '/images/icons/default-user-profile.png'} alt='profile-logo' />
                        </div>
                        <div className='profile_content'>
                            {innerWidth > 767 ?
                                <>
                                    {/* <div className='statistic'>
                                        <p>ПОДПИСЧИКОВ<span>2564</span></p>
                                        <p>ПОДПИСКИ<span>2564</span></p>
                                        <p>ЛАЙКОВ<span>5К</span></p>
                                    </div> */}
                                    <h1>{authUser.name}</h1>
                                    <p>{authUser.status ? authUser.status : 'Здесь будет отображаться Ваш статус...'}</p>
                                    <div className='social_network'>
                                        <a href='#'>
                                            <svg width="37" height="37" viewBox="0 0 37 37" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M18.5002 14.6767C17.744 14.6767 17.0048 14.9009 16.376 15.3211C15.7473 15.7412 15.2572 16.3383 14.9679 17.0369C14.6785 17.7355 14.6028 18.5043 14.7503 19.2459C14.8978 19.9876 15.262 20.6688 15.7967 21.2035C16.3314 21.7382 17.0126 22.1024 17.7543 22.2499C18.4959 22.3974 19.2647 22.3217 19.9633 22.0323C20.6619 21.743 21.259 21.2529 21.6791 20.6242C22.0993 19.9954 22.3235 19.2562 22.3235 18.5C22.3235 17.998 22.2246 17.5008 22.0325 17.0369C21.8403 16.573 21.5587 16.1516 21.2037 15.7965C20.8486 15.4415 20.4272 15.1599 19.9633 14.9677C19.4994 14.7756 19.0023 14.6767 18.5002 14.6767ZM33.8089 10.8996C33.8008 9.70908 33.5816 8.52942 33.1614 7.41546C32.852 6.60032 32.3732 5.86006 31.7567 5.24353C31.1401 4.62701 30.3999 4.14823 29.5847 3.83879C28.4708 3.41863 27.2911 3.1994 26.1006 3.19129C24.1118 3.08337 23.526 3.08337 18.5002 3.08337C13.4743 3.08337 12.8885 3.08337 10.8997 3.19129C9.70921 3.1994 8.52954 3.41863 7.41558 3.83879C6.60044 4.14823 5.86018 4.62701 5.24366 5.24353C4.62713 5.86006 4.14835 6.60032 3.83891 7.41546C3.41875 8.52942 3.19952 9.70908 3.19141 10.8996C3.0835 12.8884 3.0835 13.4742 3.0835 18.5C3.0835 23.5259 3.0835 24.1117 3.19141 26.1005C3.20801 27.2952 3.42694 28.4785 3.83891 29.6C4.14698 30.4115 4.62536 31.1474 5.24183 31.7584C5.85571 32.3786 6.59755 32.8574 7.41558 33.1613C8.52954 33.5815 9.70921 33.8007 10.8997 33.8088C12.8885 33.9167 13.4743 33.9167 18.5002 33.9167C23.526 33.9167 24.1118 33.9167 26.1006 33.8088C27.2911 33.8007 28.4708 33.5815 29.5847 33.1613C30.4028 32.8574 31.1446 32.3786 31.7585 31.7584C32.375 31.1474 32.8533 30.4115 33.1614 29.6C33.5812 28.4806 33.8004 27.296 33.8089 26.1005C33.9168 24.1117 33.9168 23.5259 33.9168 18.5C33.9168 13.4742 33.9168 12.8884 33.8089 10.8996ZM29.8931 23.233C29.8436 24.1843 29.6406 25.1214 29.2918 26.008C28.9925 26.7475 28.5476 27.4193 27.9835 27.9834C27.4194 28.5475 26.7476 28.9924 26.0081 29.2917C25.1132 29.621 24.1708 29.8032 23.2177 29.8313C21.9997 29.8313 21.676 29.8313 18.5002 29.8313C15.3243 29.8313 15.0006 29.8313 13.7827 29.8313C12.8295 29.8032 11.8872 29.621 10.9922 29.2917C10.2277 29.0076 9.53734 28.5544 8.97266 27.9659C8.41407 27.4128 7.98267 26.7447 7.7085 26.008C7.3779 25.114 7.20068 24.1706 7.18433 23.2175C7.18433 21.9996 7.18433 21.6759 7.18433 18.5C7.18433 15.3242 7.18433 15.0005 7.18433 13.7825C7.20068 12.8295 7.3779 11.8861 7.7085 10.9921C7.9926 10.2276 8.44584 9.53722 9.03433 8.97254C9.58984 8.41696 10.2573 7.98602 10.9922 7.70837C11.8872 7.37908 12.8295 7.19686 13.7827 7.16879C15.0006 7.16879 15.3243 7.16879 18.5002 7.16879C21.676 7.16879 21.9997 7.16879 23.2177 7.16879C24.1708 7.19686 25.1132 7.37908 26.0081 7.70837C26.7726 7.99247 27.463 8.44571 28.0277 9.03421C28.5863 9.58728 29.0177 10.2554 29.2918 10.9921C29.6211 11.887 29.8033 12.8294 29.8314 13.7825C29.8314 15.0005 29.8314 15.3242 29.8314 18.5C29.8314 21.6759 29.9393 21.9996 29.8931 23.2175V23.233ZM27.4264 11.763C27.2429 11.265 26.9535 10.8127 26.5782 10.4375C26.2029 10.0622 25.7506 9.77276 25.2527 9.58921C24.5689 9.35219 23.8487 9.23739 23.1252 9.25004C21.9227 9.25004 21.5835 9.25004 18.5002 9.25004C15.4168 9.25004 15.0777 9.25004 13.8752 9.25004C13.1479 9.25715 12.4276 9.39285 11.7477 9.65087C11.2573 9.82609 10.8099 10.1037 10.4351 10.4652C10.0603 10.8267 9.76672 11.2638 9.57391 11.7475C9.35003 12.4341 9.24065 13.1529 9.25016 13.875C9.25016 15.0775 9.25016 15.4167 9.25016 18.5C9.25016 21.5834 9.25016 21.9225 9.25016 23.125C9.26545 23.8515 9.40089 24.5704 9.651 25.2525C9.83455 25.7505 10.124 26.2028 10.4992 26.578C10.8745 26.9533 11.3268 27.2427 11.8247 27.4263C12.4825 27.6682 13.1747 27.8035 13.8752 27.8271C15.0777 27.8271 15.4168 27.8271 18.5002 27.8271C21.5835 27.8271 21.9227 27.8271 23.1252 27.8271C23.8524 27.82 24.5727 27.6843 25.2527 27.4263C25.7506 27.2427 26.2029 26.9533 26.5782 26.578C26.9535 26.2028 27.2429 25.7505 27.4264 25.2525C27.6844 24.5726 27.8201 23.8523 27.8272 23.125C27.8272 21.9225 27.8272 21.5834 27.8272 18.5C27.8272 15.4167 27.8272 15.0775 27.8272 13.875C27.8277 13.1471 27.6917 12.4254 27.4264 11.7475V11.763ZM18.5002 24.3892C17.7275 24.3892 16.9625 24.2368 16.2488 23.9406C15.5352 23.6445 14.887 23.2104 14.3413 22.6634C13.7957 22.1163 13.3634 21.467 13.0691 20.7526C12.7748 20.0381 12.6244 19.2727 12.6264 18.5C12.6264 17.3346 12.9722 16.1954 13.62 15.2266C14.2678 14.2578 15.1885 13.503 16.2655 13.0577C17.3425 12.6124 18.5274 12.4967 19.6702 12.7252C20.813 12.9537 21.8623 13.5161 22.6853 14.3413C23.5083 15.1664 24.068 16.2172 24.2935 17.3606C24.519 18.504 24.4001 19.6886 23.952 20.7644C23.5039 21.8403 22.7467 22.759 21.7762 23.4042C20.8057 24.0495 19.6656 24.3923 18.5002 24.3892ZM24.6668 13.7671C24.326 13.7311 24.0106 13.5701 23.7814 13.3154C23.5522 13.0606 23.4254 12.73 23.4254 12.3873C23.4254 12.0446 23.5522 11.7141 23.7814 11.4593C24.0106 11.2045 24.326 11.0436 24.6668 11.0075C25.0076 11.0436 25.323 11.2045 25.5522 11.4593C25.7815 11.7141 25.9083 12.0446 25.9083 12.3873C25.9083 12.73 25.7815 13.0606 25.5522 13.3154C25.323 13.5701 25.0076 13.7311 24.6668 13.7671Z" fill="black" />
                                            </svg>
                                        </a>
                                        <a href='#'>
                                            <svg width="37" height="37" viewBox="0 0 37 37" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M23.2376 3.08337H13.7788C5.13902 3.08337 3.0835 5.13889 3.0835 13.7626V23.2214C3.0835 31.8611 5.12303 33.9167 13.7627 33.9167H23.2215C31.8613 33.9167 33.9168 31.8772 33.9168 23.2374V13.7787C33.9168 5.13889 31.8773 3.08337 23.2376 3.08337ZM27.975 25.0842H25.7267C24.8756 25.0842 24.6187 24.3936 23.0931 22.8681C21.7601 21.5834 21.1981 21.4227 20.8608 21.4227C20.3952 21.4227 20.2666 21.5512 20.2666 22.1936V24.217C20.2666 24.7631 20.09 25.0842 18.6608 25.0842C17.2739 24.991 15.929 24.5697 14.7368 23.8549C13.5446 23.1402 12.5392 22.1525 11.8035 20.9731C10.057 18.7992 8.84179 16.2478 8.25454 13.5217C8.25454 13.1845 8.38298 12.8793 9.02537 12.8793H11.2736C11.8517 12.8793 12.0605 13.1363 12.2853 13.7305C13.3773 16.9423 15.2402 19.7366 15.995 19.7366C16.284 19.7366 16.4125 19.6081 16.4125 18.8855V15.5772C16.3161 14.0677 15.5132 13.9392 15.5132 13.3933C15.5238 13.2492 15.5901 13.115 15.698 13.019C15.8059 12.9231 15.947 12.873 16.0913 12.8793H19.6243C20.1061 12.8793 20.2666 13.1202 20.2666 13.6983V18.1628C20.2666 18.6446 20.4754 18.8051 20.62 18.8051C20.909 18.8051 21.1338 18.6446 21.6638 18.1146C22.8026 16.7259 23.7331 15.1787 24.4259 13.5217C24.4967 13.3223 24.6307 13.1516 24.8076 13.0356C24.9845 12.9196 25.1945 12.8647 25.4056 12.8793H27.6538C28.3283 12.8793 28.4728 13.2166 28.3283 13.6983C27.5102 15.5303 26.4981 17.2693 25.3092 18.8855C25.0683 19.2548 24.972 19.4475 25.3092 19.8811C25.534 20.2183 26.3209 20.8767 26.8509 21.503C27.6217 22.2719 28.2618 23.1615 28.7458 24.1368C28.9385 24.7631 28.6173 25.0842 27.975 25.0842Z" fill="black" />
                                            </svg>
                                        </a>
                                        <a href='#'>
                                            <svg width="37" height="37" viewBox="0 0 37 37" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M32.221 3.08337H4.77933C4.32957 3.08337 3.89822 3.26204 3.58019 3.58007C3.26216 3.8981 3.0835 4.32944 3.0835 4.77921V32.2209C3.0835 32.4436 3.12736 32.6641 3.21258 32.8698C3.29781 33.0756 3.42272 33.2625 3.58019 33.42C3.73767 33.5775 3.92461 33.7024 4.13036 33.7876C4.33611 33.8728 4.55663 33.9167 4.77933 33.9167H19.5485V21.9688H15.5402V17.3438H19.5485V13.875C19.4655 13.0607 19.5616 12.238 19.8302 11.4647C20.0988 10.6914 20.5333 9.98626 21.1032 9.39867C21.6732 8.81109 22.3648 8.35532 23.1295 8.06332C23.8943 7.77133 24.7136 7.65018 25.5302 7.70837C26.7301 7.70099 27.9294 7.76276 29.1222 7.89337V12.0559H26.671C24.7285 12.0559 24.3585 12.9809 24.3585 14.3221V17.2975H28.9835L28.3822 21.9225H24.3585V33.9167H32.221C32.4437 33.9167 32.6642 33.8728 32.87 33.7876C33.0757 33.7024 33.2627 33.5775 33.4201 33.42C33.5776 33.2625 33.7025 33.0756 33.7877 32.8698C33.873 32.6641 33.9168 32.4436 33.9168 32.2209V4.77921C33.9168 4.55651 33.873 4.33599 33.7877 4.13024C33.7025 3.92449 33.5776 3.73755 33.4201 3.58007C33.2627 3.4226 33.0757 3.29769 32.87 3.21246C32.6642 3.12724 32.4437 3.08337 32.221 3.08337Z" fill="black" />
                                            </svg>
                                        </a>
                                    </div>
                                    <div className='categories'>
                                        <button>КАСТИНГИ</button>
                                        <button>ОТКЛИКИ</button>
                                        <button>МОИ ОТЗЫВЫ</button>
                                    </div>
                                </>
                                :
                                <>
                                    <h1>{authUser.name}</h1>
                                    <p>{authUser.status ? authUser.status : 'Здесь будет отображаться Ваш статус...'}</p>
                                    <div className='social_network'>
                                        <a href='#'><img src='/images/icons/instagram-icon.svg' alt='instagram-icon' /></a>
                                        <a href='#'><img src='/images/icons/vk-icon.svg' alt='vk-icon' /></a>
                                        <a href='#'><img src='/images/icons/facebook-icon.svg' alt='facebook-icon' /></a>
                                    </div>
                                </>
                            }
                        </div>
                    </div>
                    <button className='hamburger_btn' onClick={() => {
                        document.body.style.overflow = 'hidden'
                        setStateAsideFilter(true);
                    }}><span></span><span></span></button>
                </div>
                {innerWidth < 768 &&
                    <>
                        <div className='categories'>
                            <button>КАСТИНГИ</button>
                            <button>ОТКЛИКИ</button>
                            <button>МОИ ОТЗЫВЫ</button>
                        </div>
                        {/* <div className='statistic'>
                            <p>ПОДПИСКИ<span>2564</span></p>
                            <p>ПОДПИСЧИКОВ<span>2564</span></p>
                            <p>ЛАЙКОВ<span>5К</span></p>
                        </div> */}
                    </>
                }
                {/* <div className='statistic'>
                    <label className='upload_post'>
                        <input type='file' onChange={this.handleUploadPhotoToFeed} />
                        Добавить
                    </label>
                    <h3>Статистика</h3>
                    <div>
                        <p>Рейтинг<span>9,5</span></p>
                        <p>ПОДПИСЧИКОВ<span>2564</span></p>
                        <p>ПОДПИСКИ<span>2564</span></p>
                        <p>ЛАЙКОВ<span>5К</span></p>
                        <p>ОТКЛИКОВ<span>5</span></p>
                        <p>КАСТИНГИ<span>10</span></p>
                        <p>СОТРУДНИЧЕСТВО<span>8</span></p>
                    </div>
                </div> */}
                <div className='statistic user_about'>
                    {/* <label className='upload_post'>
                        <input type='file' onChange={this.handleUploadPhotoToFeed} />
                        Добавить
                    </label> */}
                    <h3>{authUser.role === 'Исполнитель' ? 'Общие данные:' : 'Информация о компании:'}</h3>
                    <div>
                        <div className='grid__wrapper'>
                            {authUser.role === 'Исполнитель' &&
                                <>
                                    <p>ФИО</p>
                                    <p>{authUser.name} {authUser.middle_name} {authUser.surname}</p>
                                    <p>Дата рождения</p>
                                    <p>{authUser.birth_date.split('-').reverse().join('.')}</p>
                                    <p>Семейное положение</p>
                                    <p>{authUser.family_status === 0 ? authUser.gender === 0 ? 'Не замужем' : 'Не женат' : authUser.gender === 0 ? 'Замужем' : 'Женат'}</p>
                                    <p>Дети</p>
                                    <p>{authUser.having_children === 0 ? 'Отсутствуют' : 'Есть'}</p>
                                    {authUser.ui_languages &&
                                        <>
                                            <p>Иностранный язык</p>
                                            <p>{authUser.ui_languages}</p>
                                        </>
                                    }
                                    <p>Загран паспорт</p>
                                    <p>{authUser.inter_passport === 0 ? 'Отсутствует' : 'Есть'}</p>
                                </>
                            }
                            {authUser.description &&
                                <>
                                    <p>Деятельность</p>
                                    <p>{authUser.description}</p>
                                </>
                            }
                            {authUser.role === 'Заказчик' &&
                                <>
                                    <p>Город</p>
                                    <p>{authUser.city}</p>
                                </>
                            }
                            {authUser.address &&
                                <>
                                    <p>Адрес</p>
                                    <p>{authUser.address}</p>
                                </>
                            }
                        </div>
                        <div className='grid__wrapper'>
                            {authUser.url_site &&
                                <>
                                    <p>Сайт компании</p>
                                    <p>{authUser.url_site}</p>
                                </>
                            }
                            {authUser.email &&
                                <>
                                    <p>Почта для связи</p>
                                    <p>{authUser.email}</p>
                                </>
                            }
                            {authUser.role === 'Исполнитель' &&
                                <>
                                    <p>Город</p>
                                    <p>{authUser.city}</p>
                                </>
                            }
                            <p>Телефон для связи</p>
                            <p>{authUser.phone}</p>
                            {authUser.role === 'Исполнитель' &&
                                <>
                                    <p>Сексуальная ориентация</p>
                                    <p>{info.SexualOrientation[authUser.ui_sexual_orientation - 1].name}</p>
                                    <p>Командировки</p>
                                    <p>{authUser.business_trips === 0 ? authUser.gender === 0 ? 'Не готова' : 'Не готов' : authUser.gender === 0 ? 'Готова' : 'Готов'}</p>
                                    <p>Реклама нижнего белья</p>
                                    <p>{authUser.underwear_ads === 0 ? authUser.gender === 0 ? 'Не готова' : 'Не готов' : authUser.gender === 0 ? 'Готова' : 'Готов'}</p>
                                    <p>Социальные сети</p>
                                    <p>{authUser.social_network}</p>
                                </>
                            }
                        </div>
                    </div>
                    {authUser.role === 'Исполнитель' &&
                        <>
                            <h3>Внешние данные:</h3>
                            <div>
                                <div className='grid__wrapper'>
                                    <p>Расовая принадлежность</p>
                                    <p>{info.RacialIdentity[authUser.ui_racial_identity - 1].name}</p>
                                    <p>Цвет глаз</p>
                                    <p>{info.EyeColor[authUser.ui_eye_color - 1].name}</p>
                                    <p>Разрез глаз</p>
                                    <p>{info.EyeShape[authUser.ui_eye_shape - 1].name}</p>
                                    <p>Цвет кожи</p>
                                    <p>{info.SkinColor[authUser.ui_skin_color - 1].name}</p>
                                    <p>Форма носа</p>
                                    <p>{info.oseShape[authUser.ui_nose_shape - 1].name}</p>
                                    <p>Размер одежды</p>
                                    <p>{info.ClothesSize[authUser.ui_clothes_size - 1].name}</p>
                                    <p>Размер обуви</p>
                                    <p>{info.ShoeSize[authUser.ui_shoe_size - 1].name}</p>
                                    <p>Косметические особенности</p>
                                    <p>{info.CosmeticDetails[authUser.ui_cosmetic_details - 1].name}</p>
                                    <p>Косметическая хирургия</p>
                                    <p>{info.CosmeticSurgery[authUser.ui_cosmetic_surgery - 1].name}</p>
                                    <p>Татуировки</p>
                                    <p>{info.Tattoo[authUser.ui_tattoo - 1].name}</p>
                                </div>
                                <div className='grid__wrapper'>
                                    <p>Форма лица</p>
                                    <p>{info.FaceForm[authUser.ui_face_form - 1].name.slice(0, -2) + 'ая'}</p>
                                    <p>Губы</p>
                                    <p>{info.Lips[authUser.ui_lips - 1].name}</p>
                                    <p>Цвет волос</p>
                                    <p>{info.HairColor[authUser.ui_hair_color - 1].name}</p>
                                    <p>Длина волос</p>
                                    <p>&gt; {authUser.hair_length} см</p>
                                    <p>Стрижка волос</p>
                                    <p>{info.Haircut[authUser.ui_haircut - 1].name}</p>
                                    <p>Рост</p>
                                    <p>{info.Height[authUser.ui_height - 1].name}</p>
                                    <p>Телосложение</p>
                                    <p>{info.BodyType[authUser.ui_body_type - 1].name}</p>
                                    <p>Объем талии</p>
                                    <p>{authUser.waist_size} см</p>
                                    <p>Объем бедер</p>
                                    <p>{authUser.hip_measurements} см</p>
                                    <p>Бюст</p>
                                    <p>{authUser.bust} см</p>
                                    {authUser.ui_breast_size &&
                                        <>
                                            <p>Объем груди</p>
                                            <p>{authUser.ui_breast_size} см</p>
                                        </>
                                    }
                                </div>
                            </div>
                        </>
                    }
                    {authUser.role === 'Исполнитель' &&
                        <>
                            <h3>Личностные характеристики:</h3>
                            <div>
                                <div className='grid__wrapper'>
                                    <p>Персональные достижения</p>
                                    <p>{authUser.ui_creative_activity}</p>
                                    <p>Отличительные черты характера</p>
                                    <p>{authUser.ui_character_traits}</p>
                                    <p>Типаж</p>
                                    <p>{authUser.ui_characteristic}</p>
                                </div>
                                <div className='grid__wrapper'>
                                    <p>Основные качества</p>
                                    <p>{authUser.ui_basic_qualities}</p>
                                    <p>Дополнительные навыки</p>
                                    <p>{authUser.additional_skills}</p>
                                </div>
                            </div>
                        </>
                    }
                    {authUser.about_me &&
                        <>
                            <h3>Немного подробнее о нашей компании:</h3>
                            <p>{authUser.about_me}</p>
                        </>
                    }
                </div>
                <nav>
                    {authUser.role !== 'Исполнитель' && <Link to='/profile' className={location === 'profile' ? 'active' : ''}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="40" height="40" fill="none" viewBox="0 0 124.813 124.813"><path d="m48.083 80.355-1.915 11.374a4.158 4.158 0 0 0 1.65 4.05 4.15 4.15 0 0 0 4.361.32l10.226-5.338L72.631 96.1a4.184 4.184 0 0 0 1.924.472c.859 0 1.716-.269 2.439-.792a4.152 4.152 0 0 0 1.651-4.05l-1.913-11.374 8.234-8.077a4.159 4.159 0 0 0 1.044-4.247 4.152 4.152 0 0 0-3.341-2.823l-11.41-1.692-5.139-10.329a4.147 4.147 0 0 0-3.716-2.303 4.16 4.16 0 0 0-3.718 2.303l-5.134 10.329-11.41 1.691a4.147 4.147 0 0 0-3.339 2.823 4.147 4.147 0 0 0 1.042 4.247l8.238 8.077z" /><path d="M111.443 13.269H98.378V6.022A6.022 6.022 0 0 0 92.355 0H91.4a6.021 6.021 0 0 0-6.021 6.022v7.247H39.282V6.022A6.022 6.022 0 0 0 33.261 0h-.956a6.021 6.021 0 0 0-6.021 6.022v7.247H13.371C6.538 13.269.977 18.828.977 25.663v86.757c0 6.831 5.561 12.394 12.394 12.394h98.073c6.832 0 12.394-5.562 12.394-12.394V25.663c-.001-6.835-5.563-12.394-12.395-12.394zm-1.617 97.534H14.988V43.268h94.838v67.535z" /></svg>
                        <p>Кастинги</p>
                    </Link>}
                    <Link to={authUser.role === 'Исполнитель' ? '/profile' : '/profile/photo'} className={(authUser.role === 'Исполнитель' && location === 'profile') || location === 'photo' ? 'active' : ''}>
                        <svg fill="none" width="40px" height="40px" viewBox="0 -64 640 640" xmlns="http://www.w3.org/2000/svg"><path d="M608 0H160a32 32 0 0 0-32 32v96h160V64h192v320h128a32 32 0 0 0 32-32V32a32 32 0 0 0-32-32zM232 103a9 9 0 0 1-9 9h-30a9 9 0 0 1-9-9V73a9 9 0 0 1 9-9h30a9 9 0 0 1 9 9zm352 208a9 9 0 0 1-9 9h-30a9 9 0 0 1-9-9v-30a9 9 0 0 1 9-9h30a9 9 0 0 1 9 9zm0-104a9 9 0 0 1-9 9h-30a9 9 0 0 1-9-9v-30a9 9 0 0 1 9-9h30a9 9 0 0 1 9 9zm0-104a9 9 0 0 1-9 9h-30a9 9 0 0 1-9-9V73a9 9 0 0 1 9-9h30a9 9 0 0 1 9 9zm-168 57H32a32 32 0 0 0-32 32v288a32 32 0 0 0 32 32h384a32 32 0 0 0 32-32V192a32 32 0 0 0-32-32zM96 224a32 32 0 1 1-32 32 32 32 0 0 1 32-32zm288 224H64v-32l64-64 32 32 128-128 96 96z" /></svg>
                        <p>Фотографии</p>
                    </Link>
                    <Link to='/profile/video' className={location === 'video' ? 'active' : ''}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="40" height="40" viewBox="0 0 491.521 491.521"><path d="M491.41 245.759c-1.353-57.804-15.123-115.305-39.652-139.832-72.832-72.831-339.164-72.831-411.997 0C15.234 130.454 1.463 187.955.11 245.759c-1.433 61.235 11.07 122.81 39.651 145.906 80.113 64.736 331.884 64.736 411.997 0 28.58-23.096 41.086-84.671 39.652-145.906zm-170.419 13.619-130.453 95.838c-11.161 8.199-26.904.23-26.904-13.617V149.923c0-13.85 15.743-21.819 26.904-13.619l130.453 95.836c4.596 3.378 6.894 8.496 6.894 13.619 0 5.121-2.298 10.243-6.894 13.619z" /></svg>
                        <p>Видео</p>
                    </Link>
                    <Link to='/profile/audio' className={location === 'audio' ? 'active' : ''}>
                        <svg width="40px" height="40px" viewBox="0 0 512 512" version="1.1" xmlns="http://www.w3.org/2000/svg"><g id="Layer_1" /><g id="Layer_2"><g><g><path className="st0" d="M256,326.94L256,326.94c43.18,0,78.19-35.01,78.19-78.19V113.69c0-43.18-35.01-78.19-78.19-78.19l0,0     c-43.18,0-78.19,35.01-78.19,78.19v135.07C177.81,291.93,212.82,326.94,256,326.94z" /></g><g><path className="st0" d="M445.17,204.13h-50.45c-8.84,0-16,7.16-16,16v28.63c0,67.66-55.04,122.71-122.7,122.72     c-0.01,0-0.02,0-0.02,0s-0.02,0-0.02,0c-67.66-0.01-122.7-55.06-122.7-122.72v-28.63c0-8.84-7.16-16-16-16H66.83     c-8.84,0-16,7.16-16,16s7.16,16,16,16h34.45v12.63c0,79.91,60.9,145.87,138.72,153.9v41.85h-91.05c-8.84,0-16,7.16-16,16     s7.16,16,16,16h214.11c8.84,0,16-7.16,16-16s-7.16-16-16-16H272v-41.85c77.82-8.03,138.72-73.99,138.72-153.9v-12.63h34.45     c8.84,0,16-7.16,16-16S454.01,204.13,445.17,204.13z" /></g></g></g></svg>
                        <p>Аудио</p>
                    </Link>
                </nav>
                <section>
                    <Outlet />
                </section>
            </section>
        )
    }
}

export default Profile;